---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.ReinforcementSettings
source: html/f393ad1a-7621-ba5d-53cc-182ad43e7628.htm
---
# ReinforcementSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.